Tekla.Structures.AnalysisInternal.DotAnalysisPartSpanningProperties
Serialization structure for AnalysisPartSpanningProperties.

Tekla.Structures.AnalysisInternal.DotAnalysisPartSpanningProperties._SpanningType
The spanning type.

Tekla.Structures.AnalysisInternal.DotAnalysisPartSpanningProperties._SpanningDirection
The spanning direction.

Tekla.Structures.AnalysisInternal.DotAnalysisPartSpanningProperties.ToStruct(Tekla.Structures.Analysis.AnalysisPartSpanningProperties)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisPartSpanningProperties.FromStruct(Tekla.Structures.Analysis.AnalysisPartSpanningProperties)
DO NOT USE! For internal usage only!
P: P.